The structure of this model is:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 50, 50)            198050    
_________________________________________________________________
lstm_1 (LSTM)                (None, 50, 100)           60400     
_________________________________________________________________
dropout_1 (Dropout)          (None, 50, 100)           0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 100)               80400     
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               10100     
_________________________________________________________________
dropout_3 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 3961)              400061    
=================================================================
Total params: 749,011
Trainable params: 749,011
Non-trainable params: 0
_________________________________________________________________

All Dropout layers have 0.1 dropout.

Trained for a maximum of 500 epochs

Trained using rmsprop

Takes an input sequence of 50 words, and gives the next word

Trained with periods and commas as actual words



